In [62]:
import pandas as pd 
import numpy as np

In [63]:
chipotle = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv', sep='\t')

In [64]:
chipotle.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [65]:
chipotle.shape

(4622, 5)

In [66]:
chipotle.dtypes

order_id               int64
quantity               int64
item_name             object
choice_description    object
item_price            object
dtype: object

In [67]:
chipotle.order_id = pd.Categorical(chipotle.order_id)

In [68]:
chipotle.dtypes

order_id              category
quantity                 int64
item_name               object
choice_description      object
item_price              object
dtype: object

In [69]:
chipotle['item_price']=chipotle['item_price'].apply(lambda x: x[1:])

In [70]:
chipotle.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39
1,1,1,Izze,[Clementine],3.39
2,1,1,Nantucket Nectar,[Apple],3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98

In [71]:
chipotle.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   category
 1   quantity            4622 non-null   int64
 2   item_name           4622 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          4622 non-null   object
dtypes: category(1), int64(1), object(3)
memory usage: 232.5+ KB

choice_description has some missing values. Item price is in object data type.

In [72]:
chipotle['item_price'] = chipotle['item_price'].astype(float)

In [73]:
temp = chipotle.groupby('order_id').sum().reset_index()
temp['revenue'] = temp['quantity']*temp['item_price']
temp.sort_values(by='revenue', ascending=False).head()

     order_id  quantity  item_price  revenue
1442     1443        35      160.74  5625.90
925       926        23      205.25  4720.75
1785     1786        20      114.30  2286.00
1482     1483        14      139.00  1946.00
510       511        17      104.59  1778.03

In [74]:
chipotle.iloc[np.where(temp.revenue>= 1500)]

,order_id,quantity,item_name,choice_description,item_price
510,214,1,Burrito,"[Adobo-Marinated and Grilled Chicken, Pinto Be...",7.40
758,312,1,Chips,NaN,2.15
925,381,1,Nantucket Nectar,[Pomegranate Cherry],3.39
1442,585,1,Chicken Bowl,"[Roasted Chili Corn Salsa, [Fajita Vegetables,...",8.75
1482,602,1,Steak Bowl,"[Roasted Chili Corn Salsa, [Fajita Vegetables,...",9.25
1785,722,1,Chips and Guacamole,NaN,4.45

max pricey item

In [75]:
chipotle.loc[chipotle.item_price==max(chipotle.item_price)]

,order_id,quantity,item_name,choice_description,item_price
3598,1443,15,Chips and Fresh Tomato Salsa,NaN,44.25

max ordered item

In [76]:
chipotle.groupby('item_name').sum().reset_index().sort_values(by='quantity', ascending=False)[:5]

              item_name  quantity  item_price
17         Chicken Bowl       761     7342.73
18      Chicken Burrito       591     5575.82
25  Chips and Guacamole       506     2201.04
39        Steak Burrito       386     3851.43
10    Canned Soft Drink       351      438.75

minimum ordered items

In [79]:
chipotle.groupby('item_name').sum().reset_index().sort_values(by='quantity')[:5]

                            item_name  quantity  item_price
14                     Carnitas Salad         1        8.99
46                Veggie Crispy Tacos         1        8.49
26  Chips and Mild Fresh Tomato Salsa         1        3.00
33                       Crispy Tacos         2       14.80
36                              Salad         2       14.80

In [82]:
chipotle['revenue'] = chipotle['quantity']*chipotle['item_price']

In [84]:
chipotle.head()

,order_id,quantity,item_name,choice_description,item_price,revenue
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39,2.39
1,1,1,Izze,[Clementine],3.39,3.39
2,1,1,Nantucket Nectar,[Apple],3.39,3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98,33.96

Top 5 most revenue generated order

In [89]:
chipotle.groupby('order_id').sum().sort_values(by='revenue', ascending=False)[:5]

          quantity  item_price  revenue
order_id
1443            35      160.74  1074.24
511             17      104.59   315.29
1559            16       82.44   246.00
1660            19       70.25   222.75
926             23      205.25   205.25

Order id 1443 is the most revenue generated order more then 3 times greater then the second most revenue generated order. Let's look what he liked most.

In [91]:
chipotle.loc[chipotle.order_id==1443]

,order_id,quantity,item_name,choice_description,item_price,revenue
3598,1443,15,Chips and Fresh Tomato Salsa,NaN,44.25,663.75
3599,1443,7,Bottled Water,NaN,10.50,73.50
3600,1443,1,6 Pack Soft Drink,[Coke],6.49,6.49
3601,1443,3,Veggie Burrito,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",33.75,101.25
3602,1443,4,Chicken Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Chees...",35.00,140.00
3603,1443,3,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Chees...",27.75,83.25
3604,1443,2,Bottled Water,NaN,3.00,6.00

restaurent generated most revenue in order_id 1443. Since they ordered maximum pricey item which is "Chips and Fresh Tomato Salsa" in maxumum quantity. Let's us check anyone other liked that item.

In [95]:
chipotle.loc[(chipotle.item_name=='Chips and Fresh Tomato Salsa')&(chipotle.quantity>1)]

,order_id,quantity,item_name,choice_description,item_price,revenue
1257,511,4,Chips and Fresh Tomato Salsa,NaN,11.80,47.20
1882,759,2,Chips and Fresh Tomato Salsa,NaN,5.90,11.80
2267,912,2,Chips and Fresh Tomato Salsa,NaN,5.90,11.80
2729,1083,2,Chips and Fresh Tomato Salsa,NaN,5.90,11.80
3598,1443,15,Chips and Fresh Tomato Salsa,NaN,44.25,663.75

Looks like nobody liked Chips and Fresh Tomato as much as order id 1443.